    # linux commads

# ~ -> символ домашней директории 
# / -> символ корневой директории
# . -> обозначает текущую директорию
# .. -> обозначает предыдущую директорию


# 1. ls - для вывода списка всех директорий и файлов в текущей директории в терминале
# ls, ls Desktop, ls ~/Desktop

# 2. cd - команда для перехода из одной директории в другую
 
# 3. mkdir - создает директорию

# 4. touch - создает файл

# 5. rmdir - удаляет пустую директорию

# 6. rm - удаляет файл

# 7. rm -rf - удаляет вообще все (принудительная удаление)

# 8. cat - показывает содержимое файла

# 9. nano - открывает файл для редактрирование в графическом интерфейсе Нано
            # если нет файла то нано создает новый

pwd po