'''1. Напишите функцию Python, чтобы найти максимум трех чисел.'''
# def find_max(a, b, c):
# 	print(max(a, b, c))

# find_max(1, 5, 4)

'''2. Напишите функцию Python для суммирования всех чисел в списке.
Список образцов : (8, 2, 3, 0, 7)
Ожидаемый результат : 20'''

# def sum_all_num(list):
#     print(sum(list))

# sum_all_num([8, 2, 3, 0, 7])

'''3. Напишите функцию Python для умножения всех чисел в списке.
Список образцов : (8, 2, 3, -1, 7)
Ожидаемый результат : -336'''

# def umnoj_num(nums):
#     c = 1
#     for x in nums:
#         c *= x
#     return c
    
# print(umnoj_num((8, 2, 3, -1, 7)))

'''4. Напишите программу на Python для обращения строки.
Пример строки : «1234abcd»'''

# def reverse(str1):
#     res = ''
#     index = len(str1)
#     while index > 0:
#         res += str1[index - 1]
#         index = index -1
#     return res
# print(reverse('1234abcd'))




# ====================================example/
# 1
# count = 0
# word = 'Hello World!'
# for i in word:
#     if i == 'l':
#         count += 1
# print('Count:', count)


# 2
# fount = None
# for i in 'Hello':
#     if i == 't':
#         fount = True
#         break
#     else:
#         fount = False

# print(fount)

# ========================================/

'''5. Напишите функцию Python для вычисления факториала числа (неотрицательное целое число). Функция принимает число в качестве аргумента.'''

def fact(num):
    




