# GIT - распределенная система контроля версий. Это система для отслеживание и введение истории изменение файлов в вашем проекте . При помощи распределенности git еще и организовывает каианда работу

# Репозиторий - это хранилище вашего кода


# GitHub - веб сайт для размешешние git репозиторий в совместной разработке проектов
# ------------------------------------------------------------------------------------------

# 1. git init -> она создает локальный гит репозиторий  у вас на ПК в той директории в которой была прописана команда

# 2. git status -> команда для проверки статуса ваших файлов

# 3. git add -> комонда для добавление файлов в систему отслеживание гита, после этой команды изменение начинают фиксироваться

# 4. git commit -m  'comment' -> команда для сохранение версии в локальном репозитории вместе с комментарием к изменению

# 5. git remote add origin <url> -> это команда для того чтобы установить связ локального репозитория с удаленным в гитхпбе

# 6. git push -> для отправки изменений в локаль и  удал репо
    # git push origin main


# 1*) git init
#     2) git add .
#     3) git commit -m ''
# 4*) git remote add origin <url>
#     5) git push origin main


